//本代码用于学习数组有关知识
#include<stdio.h>

int main(void)
{
        //数组定义格式：数据类型 数组名[元素个数] = {值1，值2，},其中未定义的值全为0
        //注意元素个数必须是一个常量或常量表达式，既是须预设好数组大小。可用define定义一个常量
        //数组定义格式：数据类型 数组名[] = {值1，值2，}
        int arr[10] = {5,8,3,7,10};
        int arr1[] = {0,1,2,3,4,5,6,7,8};

        //通过数组下标改变元素值
        arr1[0] = arr[2];
        arr1[1] = 2*arr1[2];

        //数组下标：数组名[数组下标]
        //数组下标是从0开始的
        for(int i = 0,j = 0 ; i < sizeof(arr)/sizeof(arr[0]),j < sizeof(arr1)/sizeof(arr1[0]); i++,j++)
        {
                printf("arr第%d个元素的值:%d\n",i+1,arr[i]);
                printf("arr1第%d个元素的值:%d\n",i+1,arr1[i]);
        }

        //数组在内存中的存储格式以及大小
        //数组元素大小为数据类型所决定，int类型的数组元素存储大小为4个字节
        //数组的大小为数组存储大小乘以元素个数
        for (int j = 0; j < sizeof(arr)/sizeof(arr[0]);j++)
        {
                //所打印出的每个元素的地址为内存中存储该元素的首地址
                printf("第%d个元素的地址：%p\n",j+1,&arr[j]);
        }

        //数组的地址值为存储该数组的首地址值，与第一个元素的地址值相同
        //数组名为一个常量，一个指向数组首地址的常量
        printf("数组的首地址：%p\n",arr);

        //数组存储大小
        printf("数组的内存大小：%d\n", sizeof(arr));

        //元素存储大小
        printf("元素内存大小：%d\n", sizeof(arr[1]));
        return 0;
}